Revit 2027 API
BuiltInFailures.RoofFailures.OnlyUpwardFacesUsed Property
 The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OnlyUpwardFacesUsed { get; }
Public Shared ReadOnly Property OnlyUpwardFacesUsed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OnlyUpwardFacesUsed {
	FailureDefinitionId^ get ();
}
static member OnlyUpwardFacesUsed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace